Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P27.tmx
Source language: en_us
Languages: zh_cn

source: The Landscape of Pleasure
zh_cn: 快乐的景象

source: Tuesday was Family Night at Highland, and the club's waiters set up the buffet table in a chilly, vaulted dining room whose gleaming windows overlooked the final hole of the golf course.
zh_cn: 周二是海兰的家庭之夜，俱乐部的服务员们在冷气十足的拱顶餐厅里摆好了自助餐桌，透过灯光烁烁的餐厅窗户，可以俯瞰到高尔夫球场上正打着最后一洞。

source: Supper was served from half past five until eight, unfailingly, even in August, when most families vacationed to escape the suffocating heat.
zh_cn: 晚餐供应时间从五点半开始，到八点结束，从来就没有更改过，哪怕是在八月，大多数人家为躲避这令人窒息的炎热而去度假了。

source: Highland's clean, glistening food- pink slabs of roast beef, smothered chicken, deviled eggs- resembled the classic yet hearty fare served after a funeral, whose primary aim was to satisfy.
zh_cn: 海兰洁净耀眼的食物——粉红的烤牛内片、炖鸡、芥末蛋——就像葬礼过后准备的传统而可口的饭菜，就是为了让人满意。

source: The club's desserts, though, were my mother's favorite.
zh_cn: 不过，俱乐部的甜点是我妈最喜欢吃的。

source: When her black pencil skirts fit- she ordered them from Colette in Paris- my mother allowed herself a spongy snippet of coconut cake, which was baked by a widow who lived in the oldest neighborhood in Fayetteville, North Carolina.
zh_cn: 如果我妈还穿得下那件黑色铅笔裙——那裙子可是她向巴黎的科莱特时尚概念店订购的——她就会纵容自己来一小片松软的椰丝蛋糕，这种蛋糕是一位住在北卡罗莱纳州费耶特维尔市最古老地区的寡妇烘烤出来的。

source: Highland had been serving the same cakes as far back as I could remember, and my father often complained that their taste never changed.
zh_cn: 打我能记事起，海兰就一直供应着这种蛋糕，我爸经常抱怨说大家的口味从来都没变过。

source: My mother always told him that was precisely the point, but, from her, that sort of remark was ignored.
zh_cn: 我妈就经常对我爸说，这话说得倒不错，但她却从不把这类话放在心上。

source: A single cup of black coffee always signaled the end of my mother's supper, and two weeks before I left for college, she finally permitted me to have one with her.
zh_cn: 如果只剩一杯黑咖啡，那说明我妈的晚餐吃完了，在我离家去上大学的两周前，我妈终于同意我和她一起共享一块椰丝蛋糕。

source: "Diana, please get a clean plate if you want more food."
zh_cn: “黛安娜，如果你要再来点儿的话，去拿一个干净的盘子。”

source: My mother wiped the red smear of lipstick from the rim of her china cup with my father's greasy napkin.
zh_cn: 我妈拿着我爸用过的油腻腻的餐巾纸擦去自己陶瓷杯边上的红色口红印。

source: "Quit picking at your father's scraps."
zh_cn: “别挑你爸剩下的碎末吃。”

source: I finished chewing the chicken finger I'd poached from his plate.
zh_cn: 我嚼完了从爸的盘子里顺过来的鸡柳。

source: My father was drinking in the club's smoky, English-style bar with a partner in his law firm.
zh_cn: 我爸要和他律师事务所的搭档在俱乐部烟雾缭绕的英式吧台喝酒。

source: My mother forked a bite of coconut cake off my dessert plate and eyed the other wives in the meager crowd.
zh_cn: 我妈从我甜点盘子里叉了一口椰丝蛋糕，注视着稀稀拉拉的人群里其他的已婚妇女。

source: In those days, like today, the women my mother's age wore leather pumps and large, splendid diamond studs.
zh_cn: 那年头，与我妈年龄相仿的女人们都穿着皮高跟鞋，戴着大大的灿烂的钻石耳钉。

source: "Don't slouch, Diana," she said.
zh_cn: “别一副懒散相，黛安娜，”妈说道。

source: "Where's your friend Christine tonight?"
zh_cn: “今晚你朋友克莉丝汀在哪？”

source: "Her mother's in Barbados," I said.
zh_cn: “她妈妈在巴巴多斯，”我答道。

source: "Their maid's fixing her supper."
zh_cn: “她家保姆给她做饭。”

source: My mother frowned.
zh_cn: 我妈皱了皱眉。

source: "Christine's mother ought to learn how to keep a handle on her belongings."
zh_cn: “克莉丝汀的妈应该学学怎样当家管事。”

source: I stood up quickly.
zh_cn: 我立马站了起来。

source: "I'm going to the ladies' room."
zh_cn: “我去卫生间。”

source: My mother pursed her lips.
zh_cn: 我妈噘起了嘴。

source: "Hurry.
zh_cn: “快点。

source: Your father needs rounding up."
zh_cn: 你爸还要赶着聚会呢。”

source: "I'll be back in a minute."
zh_cn: “过一分钟就回来。”

source: The hallway outside the bathroom was padded with dusty green carpet.
zh_cn: 浴室外面的走廊铺着落满灰尘的绿地毯。

source: A notched console table stood against the wall.
zh_cn: 一张刻着V形痕的螺形托脚小桌贴墙而立。

source: Two gilt bud vases, perpetually bursting with dried violets, partially concealed an old rotary phone.
zh_cn: 两个镀金的插花花瓶，总是插着干紫罗兰，隐隐绰绰地遮住了老式转轮拨号电话机。

source: It was icy inside the bathroom, but I lingered in front of the full-length mirror.
zh_cn: 浴室里冰冷冰冷的，但我还在穿衣镜前慢慢地打扮。

source: Carefully, I retraced my mouth with the nude Wet n Wild lipstick I'd found in the front seat of my convertible the day before.
zh_cn: 用润激牌的裸色唇膏重新涂着嘴唇，这支唇膏还是我前天在我敞篷车的前车座上找到的。

source: I held my breath until the tube was back in my dress pocket.
zh_cn: 我一直屏住呼吸，直到把这支唇膏放回衣服口袋里。

source: I started to push the bathroom door open, but a man's voice- a muffled, electric hum- stopped me.
zh_cn: 我这才推开浴室门，但是一个男子的声音——哼的一声，低沉而激动——惊动了我，让我停了下来。

source: I cracked the door.
zh_cn: 我把门推开了一条隙缝。

source: My father's hip was pressed against the console table, and he was coiling the phone cord around his narrow wrist.
zh_cn: 我爸的髋部紧靠着螺形托脚小桌，用电话线缠绕着自己细细的手腕。

source: His face was tilted away from mine.
zh_cn: 他的脸远远地斜对着我。

source: "There's no reason to feel that way.
zh_cn: “没有道理要这样想。

source: You know better.
zh_cn: 你比我更明白。

source: I know you do.
zh_cn: 我是知道你的。

source: Think."
zh_cn: 再想想。”

source: When I tapped the small of his back, he jerked around.
zh_cn: 我轻轻地拍了拍爸的腰椎，他猛地转过身来。

source: His earlobes burned rusty red, as if they'd been pinched.
zh_cn: 他耳垂如火烧般锈红，仿佛被人夹得生痛。

source: The receiver plunked hollowly down on the carpet.
zh_cn: 听筒猛地落到了地毯上，发出了低沉的声响。

source: "Hey there, baby doll."
zh_cn: “嗨，过来，宝贝！”

source: "Mom's ready to go."
zh_cn: “妈妈准备出发了。”

source: I squeezed his elbow, and his gold cuff links winked in the dim light.
zh_cn: 我捏了捏他的胳膊肘，他衬衫上金黄色的袖扣在昏暗的灯光下一闪一闪的。

source: Each one resembled a man's tooth.
zh_cn: 每一颗都像一颗男人的牙齿。

source: I'd paid for them with money I'd earned lifeguarding at the club's pool the summer before.
zh_cn: 那些袖扣是我花钱买的，钱是我去年夏天在俱乐部游泳池当救生员赚的。

source: Whenever my father argued an important case, he wore them to court.
zh_cn: 只要我爸出庭为重大的案子辩护，他就会戴着这些袖扣。

source: He raised his Old-Fashioned.
zh_cn: 爸爸举起了古典鸡尾酒。

source: "You go on back to the table," he said.
zh_cn: “回到你的餐桌上，”他说。

source: "I'll meet you two in the bar.
zh_cn: “我会在酒吧和你们俩儿碰面的。

source: I haven't signed my ticket yet."
zh_cn: 我的单子还没签呢。”

source: I flitted back into the dining room.
zh_cn: 我悄悄地溜回饭厅。

source: The instant my mother spied me, she sprang up.
zh_cn: 我妈一看到我，就现身了。

source: "It's late," she said, and pressed her lips together.
zh_cn: “迟到了，”她说着，双唇紧闭。

source: "Why don't you get him tonight?"
zh_cn: “你今晚为什么没叫上他？”

source: At the bar, my father was standing beside a squat coffee table with his partner and a friend.
zh_cn: 酒吧里，我爸站在一张低矮的咖啡桌旁，和他在一起的是他的搭档和一个朋友。

source: Like his partner, he wore a soft, gorgeous beige suit, with his white shirt parted a little ways at the neck.
zh_cn: 我爸和他搭档一样，穿着一件柔软华丽的米色套装，把白色衬衫在脖子处的扣子解了开来。

source: When I caught his eye, my father promptly stubbed out his cigarette.
zh_cn: 当我看着我爸时，他迅速掐灭了香烟。

source: The other man beside him winked shyly at me.
zh_cn: 他身边的另一个男人向我羞涩地眨着眼。

source: This man was tall, and carefully yet casually dressed.
zh_cn: 那个男人身材高大，穿着齐整但很随意。

source: I'd seen him before- his name was Russell.
zh_cn: 我以前见过他——他叫罗素。

source: He wasn't a member of Highland, but he and my father had become friendly the year before.
zh_cn: 他不是海兰的会员，但是他和我爸一年前就成了好朋友。

source: He restored classic cars, Thunderbirds and Mustangs, to pristine condition.
zh_cn: 他是修老牌轿车的，什么雷鸟啊，野马啊，修得它们完好如初。

source: My father often repeated tales about Russell's Army tours; Russell was a retired officer.
zh_cn: 我爸经常重复着罗素军旅生涯的故事；罗素是一名退役军官。

source: "He's unstoppable," my father often said in an edgy, admiring voice.
zh_cn: “他是阻止不了的，”我爸经常用一种忧心忡忡但满怀敬仰的口吻说。

source: "That man's unstoppable."
zh_cn: “那个人是阻止不了的。”

source: Russell's eyes met mine.
zh_cn: 罗素的双眼与我的对个正着。

source: "Here for your dad?"
zh_cn: “找你爸？”

source: He was at least an inch taller than my father, with huge, pale gray eyes.
zh_cn: 他比我爸至少高一寸，长着一双大大的淡灰色眼睛。

source: His cheeks were tan, lean.
zh_cn: 古铜色的双颊清瘦。

source: "Are you trying to keep him on the straight and narrow?"
zh_cn: “来看你爸守不守规矩？”

source: My father's eyes darkened.
zh_cn: 我爸双眼充满了忧郁。

source: "That's enough."
zh_cn: “够了。”

source: He clasped my shoulder.
zh_cn: 他抓住我的肩膀。

source: "Diana leaves for UNC in a couple of weeks.
zh_cn: “黛安娜再过两周就要去北卡罗莱纳大学了。

source: She won a scholarship, tuition and everything."
zh_cn: 她获得了奖学金、免了学费，等等等等。”

source: "She looks like a movie star." Russell's mouth tightened.
zh_cn: “她看起来像一名电影明星。”罗素的嘴紧绷着。

source: "An old-school one."
zh_cn: “一名老派明星。”

source: My father flattened a hand between my shoulder blades.
zh_cn: 我爸把一只手平摊在我肩胛骨中间。

source: "She does, doesn't she?"
zh_cn: “当然啦，对吧？”

source: They nodded, and a thrilling heat bloomed beneath my skin.
zh_cn: 他们点点头，我皮肤上鸡皮疙瘩直起。

source: After my father drove us home, he retreated to his study off the foyer, and my mother went into the kitchen and uncorked a bottle of cheap white wine.
zh_cn: 我爸开车送我们到家后，就穿过门厅进了书房，我妈去了厨房，拿了一瓶低廉的白葡萄酒，拔出了瓶塞。

source: When I was in eighth grade, she and my father had tried to quit drinking.
zh_cn: 自我八年级起，她和我爸就已经在努力戒酒。

source: It was their final, failed attempt.
zh_cn: 这次是最后一次，但没戒成。

source: After that, my mother began repeating a line from a bald psychologist on television: you can never escape your own mind.
zh_cn: 从此，我妈就开始不断地说着电视里一个秃了头的心理学家的一句话：你永远都骗不了自己的心。

source: Fate was your mind, she often said, and your mind was set in stone at birth.
zh_cn: 我妈经常说，命运就是你的心，你的心生下来就已注定，永不改变。

source: A mound of pink shopping bags lay on the kitchen table.
zh_cn: 厨房餐桌上摞着一堆粉红色的购物袋。

source: My mother fingered the white down comforter she'd bought for my dorm room that afternoon.
zh_cn: 我妈手指上沾着的白葡萄酒滴落在我宿舍用的被子上，那被子还是当天下午买的。

source: We still had to order my dresses for rush.
zh_cn: 我们还得赶紧订购我的衣服。

source: She filled her chipped wine glass to the brim.
zh_cn: 她往自己那有缺口的白葡萄酒杯里倒满了酒，酒已经满到了杯子边。

source: "Quit looking at me like that, Diana.
zh_cn: “别那样看我，戴安娜。

source: You know how crazy that makes me."
zh_cn: 你知道这会让我多么疯狂吗?”

source: The door to the study hung open, and every few minutes, my father's laughter- a low, nervy thrumming- could be heard.
zh_cn: 去书房的门微微地开着，每隔几分钟，都会传来我爸的笑声——低沉、冷静、单调的哼哼声。

source: My mother bolted her wine.
zh_cn: 我妈把瓶塞拧进了酒瓶。

source: "Your father acts just like Daddy sometimes."
zh_cn: “你爸有时还真像当爹的。”

source: She stood ramrod straight and marched out of the kitchen, drawn, apparently, by a wiry, irresistible force.
zh_cn: 妈站得笔直，齐步走出厨房，仿佛是被一种不可抵挡的强韧之力牵引着。

source: My car keys lay in a scarlet bowl on the counter.
zh_cn: 我的车钥匙躺在长条桌上的一个绯红色大腕里。

source: The bowl also contained three pink-lacquered chicken eggs.
zh_cn: 碗里还装有三个涂了粉红颜色的鸡蛋。

source: My mother had blown out their insides with a coffee straw before incising circles into their sides.
zh_cn: 我妈先用一根咖啡吸管把鸡蛋里面的东西全部吹出去，然后在鸡蛋表面刻出一些圈。

source: Tiny painted figurines from Crafts, Frames & Things were used to re-create scenes from "Cinderella" and "Snow White" inside them.
zh_cn: 最后，再用从“工艺品及相框制品”店里买来的微型彩绘雕像在鸡蛋里面摆成《灰姑娘》和《白雪公主》的场景。

source: Every year, before Christmas, she sold these ornaments at a friend's booth during the Junior League's Holiday Fair.
zh_cn: 每年，圣诞节前，我妈都会把这些装饰物摆在一个朋友的摊子上，在青年团假日交易会期间售卖。

source: It was nearly eight.
zh_cn: 差不多快八点了。

source: The shouting and crying would begin any minute now- and were bound to last for hours.
zh_cn: 现在每一时刻都会出现呼喊声，而且肯定延续几个小时。

source: My father hadn't come home at all the night before, and my mother had sat up on the chaise lounge in her sitting room until dawn, smoking and watching QVC.
zh_cn: 我爸前一天晚上根本没有回家，我妈笔直地坐在客厅的沙发床上抽烟、看美国家庭购物网，直到天亮时分。

source: Usually, after a night like that, dull, mangled-looking rings and bracelets arrived in the mail a week later.
zh_cn: 通常，这样的一晚过后，邮箱里一周之后就会出现暗淡无光的变形戒指和手镯。

source: Most found their way into my jewelry box.
zh_cn: 绝大部分都进入了我的首饰盒。

source: Whenever I showed the heavy gold cuffs to Christine, she cooed, "That's sexy stuff!"
zh_cn: 每当我向克莉丝汀看这些沉重的金色手铐时，她咕咕地说。“多性感的东西啊！”

source: I called her from my convertible.
zh_cn: 我从我的敞篷车里打电话给她。

source: She was already at Buchanan's, where a bartender twice our age served her, and whoever was with her, spiked Cokes.
zh_cn: 她早就在布坎南了，一个年龄大我一倍的服务员招呼着她，和她在一起的那个人往酒里掺着可乐。

source: All we had to do was remember to keep our traps shut, Christine said.
zh_cn: 我们只要记住闭嘴就完事了，克莉丝汀说道。

source: Christine was hunched over a grimy table in the smoking section.
zh_cn: 克莉丝汀弓着身子趴在吸烟区的一张脏兮兮的桌子上。

source: Beside her sat a girl I'd never seen before; a basting of greasy foundation made her look as if she were permanently snared in a camera flash.
zh_cn: 身旁坐着一个我从未见过面的女孩；女孩涂了一层油腻腻的粉底霜，似乎永远都是照相机闪光灯的焦点。

source: She held Christine's pink Chanel purse on her lap.
zh_cn: 她拿着克莉丝汀的粉红色香奈尔钱包，搁在膝盖上。

source: Christine wore an inky silk blouse that hugged the silhouette of her bra.
zh_cn: 克莉丝汀穿着一件深黑色丝绸短衫，紧得都勒出了文胸轮廓的痕迹。

source: She was forever trying out new looks, and recently she'd begun dressing like the chilly siren in Belle de Jour, her mother's favorite foreign film.
zh_cn: 她不断尝试新的装扮，最近又穿成《白日美人》中令人寒战的妖艳女子模样，《白日美人》是她妈妈非常喜欢的一部国外电影。

source: The blouse originally belonged to her mother, but they constantly traded clothes.
zh_cn: 那件短衫本是她妈妈的，不过她和她妈妈经常你穿我的、我穿你的。

source: Her mother said Christine was her best friend.
zh_cn: 她妈妈说克莉丝汀是她最好的朋友。

source: Christine pointed to the dark-red cups on the table. "Want a Coke?"
zh_cn: 克莉丝汀指着桌上暗红色的杯子说，“来一杯可乐，怎样？”

source: "Sure."
zh_cn: “好。”

source: The other girl pushed one toward me.
zh_cn: 旁边的女孩朝我推来了一个杯子。

source: Her filmy hazel eyes- they were furtive, weirdly gleeful, like Christine's- flicked up and down the front of my linen shift.
zh_cn: 她用那双朦胧的淡褐色眼睛上下打量着我亚麻直筒式连衣裙的胸前，她的双眼与克莉丝汀的相仿，狡黠而又充满奇特的欣喜。

source: "I saw your mother's ex-boyfriend at the club tonight," I said.
zh_cn: “我今天晚上在俱乐部看见你妈妈的前男友了，”我说。

source: Christine lit another cigarette and inhaled deeply.
zh_cn: 克莉丝汀又点了一支烟，深深地吸了一口。

source: Her mother was vacationing in Barbados with a stylish orthodontist.
zh_cn: 她妈妈正在巴巴多斯和一位时髦的牙齿整形医生度假。

source: "You mean the last one?
zh_cn: “你是说最近分手的那个？

source: Who's he with now?"
zh_cn: 他现在和谁在一起？”

source: I tasted my drink.
zh_cn: 我喝了口可乐。

source: "He was only in the bar."
zh_cn: “就他一个人，在吧台。”

source: "Russell's fucking hot," Christine said.
zh_cn: “罗素真他妈的热情，”克莉丝汀。

source: "Even for an old dude."
zh_cn: “甚至对一个老家伙都这么热情。”

source: "He's probably about 40."
zh_cn: “他可能40来岁。”

source: Christine passed her cigarette to the other girl, who smiled clumsily, adoringly.
zh_cn: 克莉丝汀把烟递给了那个女孩，那女孩一脸深情地傻笑着。

source: She was missing teeth and wore a spiked wristband.
zh_cn: 她正处于换牙阶段，戴着有锥形尖顶的腕带。

source: Speech seemed beyond her now.
zh_cn: 现在她还听不懂我们说什么。

source: "So, how're things at home?"
zh_cn: “好啦，家里情况怎样？”

source: Christine slurred her words. Her maid was sleeping at her house while her mother was away.
zh_cn: 克莉丝汀含糊不清地说道，她妈外出后保姆就在她家睡。

source: The maid recited verses from Exodus while she fried chicken wings for supper, Christine said.
zh_cn: 她家保姆边做晚餐吃的炸鸡翅，边吟诵着《出埃及记》里的诗句。

source: "Things are fine," I said.
zh_cn: “挺好的嘛，”我说。

source: She waggled her bare ring finger.
zh_cn: 她晃了晃她的无名指，无名指上什么都没戴。

source: "That's not what my mother told me before she took off."
zh_cn: “我妈走之前可不是这么说的。”

source: I pressed the tip of my cigarette into a gash in the plastic tabletop.
zh_cn: 我把烟头朝塑胶桌面的裂缝里摁了摁。

source: The back of my tongue tasted sour.
zh_cn: 我的舌头感觉一股酸味。

source: "Wasn't it your father who fucked his way down our street?"
zh_cn: “难道不是你爸来我们街乱搞？”

source: The other girl dropped her burning cigarette into her drink.
zh_cn: 那个女孩把正抽着的香烟扔进了她的饮料里。

source: Christine's eyes widened.
zh_cn: 克莉丝汀双眼睁得大大的。

source: "Touche, Diana," she said.
zh_cn: “是啊，”她应声道。

source: She grinned, but I didn't smile back.
zh_cn: 她咧嘴一笑，但我没有报以一笑。

source: I'd learned when to say nothing and mean it.
zh_cn: 我知道什么时候该闭而不语，什么时候该该认真对待。

source: Christine laughed. "Forget it."
zh_cn: 克莉丝汀笑道，“算了，不想了。”

source: She ran two bony fingers through her long, soft blond hair.
zh_cn: 她两根瘦削的手指穿过柔软的金色长发。

source: "Anyway, my mom still says my dad was the best screw ever.
zh_cn: “不管怎样，我妈还在说我爸的床上功夫是最好的。

source: Some people get off on being treated like shit.
zh_cn: 有些人看到别人把他们当垃圾便感到兴奋。

source: That's their oxygen."
zh_cn: 不这样，他们好像就没命似的。”

source: I scanned the room.
zh_cn: 我扫视了房间周围。

source: "When're you leaving for Chapel Hill?"
zh_cn: “你什么时候出发去查布尔希尔？”

source: "Same day as you."
zh_cn: “和你同一天。”

source: She shrugged.
zh_cn: 她耸了耸肩。

source: "Finally, I'm blowing this joint."
zh_cn: “我最终是要跑路的。”

source: I went to the bathroom, and when I came back, they'd jammed their chairs together so that Christine's cheek touched the other girl's temple.
zh_cn: 我去了趟洗手间，等我回来时，发现她们把椅子挤到了一起，克莉丝汀就可以把脸颊贴在那个女孩的鬓角。

source: I rapped on the table with my knuckles.
zh_cn: 我用指关节敲了敲桌子。

source: The other girl panted a little.
zh_cn: 那个女孩喘了一小口气。

source: Christine stared at me.
zh_cn: 克莉丝汀瞪着我。

source: "See someone you know?" she asked.
zh_cn: “看到了你认识的人？”

source: "Maybe."
zh_cn: “是吧。”

source: Their eyes shone.
zh_cn: 她们两眼放光。

source: "Call."
zh_cn: “打电话。”

source: "What?"
zh_cn: “什么？”

source: "After you go," Christine said.
zh_cn: “你去了后再打，”克莉丝汀说。

source: "Stop acting stupid," I said.
zh_cn: “别傻了，”我说。

source: "I'll be fine."
zh_cn: “我会没事的。”

source: "Elle va," Christine said.
zh_cn: “她，”克莉丝汀说道。

source: "Don't let anybody catch you."
zh_cn: “别让别人抓住你。”

source: I walked toward the other side of the bar.
zh_cn: 我朝酒吧的另一头走去。

source: Russell's booth was directly under one of the restaurant's plastic lanterns, which had been scoured to resemble antiques.
zh_cn: 罗素的隔间就在餐厅里一个塑料灯笼的正下方，灯笼擦洗得像古董一样。

source: I'd noticed him on my trip to the bathroom.
zh_cn: “我在去洗手间的路上就注意到了他。

source: Christine must not have seen him; she'd surely have said something.
zh_cn: 克莉丝汀肯定还没见过他；要不然她肯定会说些什么的。”

source: I said hello, and his eyes quickly floated up.
zh_cn: 我打了声招呼，罗素立即抬起眼来。

source: "Diana."
zh_cn: “戴安娜。”

source: His mouth formed a taut O.
zh_cn: 他的嘴拉紧成O形。

source: "You here with your mother?"
zh_cn: “你和你妈在一起？”

source: "No."
zh_cn: “没有。”

source: I managed a nonchalant shrug.
zh_cn: 我耸了耸肩，试图表现出一幅不在乎的样子。

source: "Just a couple of girls."
zh_cn: “我正和两个女孩在一起。”

source: He fingered his Zippo.
zh_cn: 他拨弄着芝宝牌打火机。

source: "How's your mother?"
zh_cn: “你妈怎样？”

source: "Fine."
zh_cn: “还好。”

source: A man I didn't know was with him.
zh_cn: 一个我不认识的男人和他在一起。

source: He was slightly younger than Russell, but had the same tan, veined neck and arms of men accustomed to gyms, weight machines.
zh_cn: 那个男人比罗素年轻一点点，但和罗素一样，棕褐色脖子青筋直冒，手臂就如同常去健身房玩举重机的那般健壮。

source: "Do you want to sit down?"
zh_cn: “要坐一下吗？”

source: Russell held his white shirt cuffs an inch above the tabletop.
zh_cn: 罗素抬了抬手，白衬衫的袖口离开桌面一英寸。

source: "Just for a minute, maybe?"
zh_cn: “一分钟也行。”

source: "Only for a minute."
zh_cn: “那就一分钟吧。”

source: He slid over, and I scooted in beside him.
zh_cn: 罗素挪到一边，我挤了进去坐在他身旁。
